Duet3D/Duet3Expansion/src/atmel/SAME51_DFP/1.1.129/edc/ATSAME51J18A.PIC
      <edc:SFRDef edc:_addr="0x41003FD0" edc:access="------------------------rrrrrrrr" edc:cname="PID4" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="JEPCC" edc:desc="JEP-106 Continuation Code" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FKBC" edc:desc="4KB count" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41003FD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU"/>
      <edc:SFRDef edc:_addr="0x41003FD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU"/>
      <edc:SFRDef edc:_addr="0x41003FDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU"/>
      <edc:SFRDef edc:_addr="0x41003FE0" edc:access="------------------------rrrrrrrr" edc:cname="PID0" edc:impl="0xFF" edc:mclr="00000000000000000000000011010000" edc:nzwidth="0x20" edc:por="00000000000000000000000011010000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PARTNBL" edc:desc="Part Number Low" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41003FE4" edc:access="------------------------rrrrrrrr" edc:cname="PID1" edc:impl="0xFF" edc:mclr="00000000000000000000000011111100" edc:nzwidth="0x20" edc:por="00000000000000000000000011111100" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PARTNBH" edc:desc="Part Number High" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="JEPIDCL" edc:desc="Low part of the JEP-106 Identity Code" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41003FE8" edc:access="------------------------rrrrrrrr" edc:cname="PID2" edc:impl="0xFF" edc:mclr="00000000000000000000000000001001" edc:nzwidth="0x20" edc:por="00000000000000000000000000001001" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="JEPIDCH" edc:desc="JEP-106 Identity Code High" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="JEPU" edc:desc="JEP-106 Identity Code is used" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Revision Number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41003FEC" edc:access="------------------------rrrrrrrr" edc:cname="PID3" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="CUSMOD" edc:desc="ARM CUSMOD" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REVAND" edc:desc="Revision Number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41003FF0" edc:access="------------------------rrrrrrrr" edc:cname="CID0" edc:impl="0xFF" edc:mclr="00000000000000000000000000001101" edc:nzwidth="0x20" edc:por="00000000000000000000000000001101" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLEB0" edc:desc="Preamble Byte 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41003FF4" edc:access="------------------------rrrrrrrr" edc:cname="CID1" edc:impl="0xFF" edc:mclr="00000000000000000000000000010000" edc:nzwidth="0x20" edc:por="00000000000000000000000000010000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLE" edc:desc="Preamble" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CCLASS" edc:desc="Component Class" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41003FF8" edc:access="------------------------rrrrrrrr" edc:cname="CID2" edc:impl="0xFF" edc:mclr="00000000000000000000000000000101" edc:nzwidth="0x20" edc:por="00000000000000000000000000000101" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLEB2" edc:desc="Preamble Byte 2" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41003FFC" edc:access="------------------------rrrrrrrr" edc:cname="CID3" edc:impl="0xFF" edc:mclr="00000000000000000000000010110001" edc:nzwidth="0x20" edc:por="00000000000000000000000010110001" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLEB3" edc:desc="Preamble Byte 3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004000" edc:access="nnnnnnnnnnnnnn--" edc:cname="CTRLA" edc:impl="0xFFFC" edc:mclr="0000000000000100" edc:nzwidth="0x10" edc:por="0000000000000100" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AUTOWS" edc:desc="Auto Wait State Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSPEN" edc:desc="Suspend Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WMODE" edc:desc="Write Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MAN" edc:desc="Manual Write" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ADW" edc:desc="Automatic Double Word Write" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="AQW" edc:desc="Automatic Quad Word" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="AP" edc:desc="Automatic Page Write" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRM" edc:desc="Power Reduction Mode during Sleep" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SEMIAUTO" edc:desc="NVM block enters low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode upon first access." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FULLAUTO" edc:desc="NVM block enters low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode when system is not in standby mode." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MANUAL" edc:desc="NVM block does not enter low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode upon first access." edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWS" edc:desc="NVM Read Wait States" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="AHBNS0" edc:desc="Force AHB0 access to NONSEQ, burst transfers are continuously rearbitrated" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AHBNS1" edc:desc="Force AHB1 access to NONSEQ, burst transfers are continuously rearbitrated" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CACHEDIS0" edc:desc="AHB0 Cache Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CACHEDIS1" edc:desc="AHB1 Cache Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004002" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x41004004" edc:access="wwwwwwww-wwwwwww" edc:cname="CTRLB" edc:impl="0xFF7F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x7">
              <edc:SFRFieldSemantic edc:cname="EP" edc:desc="Erase Page - Only supported in the USER and AUX pages." edc:when="(field &amp; 0x7F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="EB" edc:desc="Erase Block - Erases the block addressed by the ADDR register, not supported in the user page" edc:when="(field &amp; 0x7F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WP" edc:desc="Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register, not supported in the user page" edc:when="(field &amp; 0x7F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="WQW" edc:desc="Write Quad Word - Writes a 128-bit word at the location addressed by the ADDR register." edc:when="(field &amp; 0x7F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="SWRST" edc:desc="Software Reset - Power-Cycle the NVM memory and replay the device automatic calibration procedure and resets the module configuration registers" edc:when="(field &amp; 0x7F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="LR" edc:desc="Lock Region - Locks the region containing the address location in the ADDR register." edc:when="(field &amp; 0x7F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="UR" edc:desc="Unlock Region - Unlocks the region containing the address location in the ADDR register." edc:when="(field &amp; 0x7F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="SPRM" edc:desc="Sets the power reduction mode." edc:when="(field &amp; 0x7F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="CPRM" edc:desc="Clears the power reduction mode." edc:when="(field &amp; 0x7F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="PBC" edc:desc="Page Buffer Clear - Clears the page buffer." edc:when="(field &amp; 0x7F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="SSB" edc:desc="Set Security Bit" edc:when="(field &amp; 0x7F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="BKSWRST" edc:desc="Bank swap and system reset, if SMEE is used also reallocate SMEE data into the opposite BANK" edc:when="(field &amp; 0x7F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="CELCK" edc:desc="Chip Erase Lock - DSU.CE command is not available" edc:when="(field &amp; 0x7F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="CEULCK" edc:desc="Chip Erase Unlock - DSU.CE command is available" edc:when="(field &amp; 0x7F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="SBPDIS" edc:desc="Sets STATUS.BPDIS, Boot loader protection is discarded until CBPDIS is issued or next start-up sequence" edc:when="(field &amp; 0x7F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="CBPDIS" edc:desc="Clears STATUS.BPDIS, Boot loader protection is not discarded" edc:when="(field &amp; 0x7F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="ASEES0" edc:desc="Activate SmartEEPROM Sector 0, deactivate Sector 1" edc:when="(field &amp; 0x7F) == 0x30"/>
              <edc:SFRFieldSemantic edc:cname="ASEES1" edc:desc="Activate SmartEEPROM Sector 1, deactivate Sector 0" edc:when="(field &amp; 0x7F) == 0x31"/>
              <edc:SFRFieldSemantic edc:cname="SEERALOC" edc:desc="Starts SmartEEPROM sector reallocation algorithm" edc:when="(field &amp; 0x7F) == 0x32"/>
              <edc:SFRFieldSemantic edc:cname="SEEFLUSH" edc:desc="Flush SMEE data when in buffered mode" edc:when="(field &amp; 0x7F) == 0x33"/>
              <edc:SFRFieldSemantic edc:cname="LSEE" edc:desc="Lock access to SmartEEPROM data from any mean" edc:when="(field &amp; 0x7F) == 0x34"/>
              <edc:SFRFieldSemantic edc:cname="USEE" edc:desc="Unlock access to SmartEEPROM data" edc:when="(field &amp; 0x7F) == 0x35"/>
              <edc:SFRFieldSemantic edc:cname="LSEER" edc:desc="Lock access to the SmartEEPROM Register Address Space (above 64KB)" edc:when="(field &amp; 0x7F) == 0x36"/>
              <edc:SFRFieldSemantic edc:cname="USEER" edc:desc="Unlock access to the SmartEEPROM Register Address Space (above 64KB)" edc:when="(field &amp; 0x7F) == 0x37"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMDEX" edc:desc="Command Execution" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="KEY" edc:desc="Execution Key" edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
