Duet3D/Duet3Expansion/src/atmel/SAME51_DFP/1.1.129/edc/ATSAME51J18A.PIC
      <edc:SFRDef edc:_addr="0x420000E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TXBCIE" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="CFIE0" edc:desc="Cancellation Finished Interrupt Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE1" edc:desc="Cancellation Finished Interrupt Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE2" edc:desc="Cancellation Finished Interrupt Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE3" edc:desc="Cancellation Finished Interrupt Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE4" edc:desc="Cancellation Finished Interrupt Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE5" edc:desc="Cancellation Finished Interrupt Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE6" edc:desc="Cancellation Finished Interrupt Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE7" edc:desc="Cancellation Finished Interrupt Enable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE8" edc:desc="Cancellation Finished Interrupt Enable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE9" edc:desc="Cancellation Finished Interrupt Enable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE10" edc:desc="Cancellation Finished Interrupt Enable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE11" edc:desc="Cancellation Finished Interrupt Enable 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE12" edc:desc="Cancellation Finished Interrupt Enable 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE13" edc:desc="Cancellation Finished Interrupt Enable 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE14" edc:desc="Cancellation Finished Interrupt Enable 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE15" edc:desc="Cancellation Finished Interrupt Enable 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE16" edc:desc="Cancellation Finished Interrupt Enable 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE17" edc:desc="Cancellation Finished Interrupt Enable 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE18" edc:desc="Cancellation Finished Interrupt Enable 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE19" edc:desc="Cancellation Finished Interrupt Enable 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE20" edc:desc="Cancellation Finished Interrupt Enable 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE21" edc:desc="Cancellation Finished Interrupt Enable 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE22" edc:desc="Cancellation Finished Interrupt Enable 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE23" edc:desc="Cancellation Finished Interrupt Enable 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE24" edc:desc="Cancellation Finished Interrupt Enable 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE25" edc:desc="Cancellation Finished Interrupt Enable 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE26" edc:desc="Cancellation Finished Interrupt Enable 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE27" edc:desc="Cancellation Finished Interrupt Enable 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE28" edc:desc="Cancellation Finished Interrupt Enable 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE29" edc:desc="Cancellation Finished Interrupt Enable 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE30" edc:desc="Cancellation Finished Interrupt Enable 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFIE31" edc:desc="Cancellation Finished Interrupt Enable 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420000E8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x420000F0" edc:access="--nnnnnn--nnnnnnnnnnnnnnnnnnnnnn" edc:cname="TXEFC" edc:impl="0x3F3FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EFSA" edc:desc="Event FIFO Start Address" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="EFS" edc:desc="Event FIFO Size" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFWM" edc:desc="Event FIFO Watermark" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420000F4" edc:access="------rr---rrrrr---rrrrr--rrrrrr" edc:cname="TXEFS" edc:impl="0x31F1F3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EFFL" edc:desc="Event FIFO Fill Level" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFGI" edc:desc="Event FIFO Get Index" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EFPI" edc:desc="Event FIFO Put Index" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EFF" edc:desc="Event FIFO Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:desc="Tx Event FIFO Element Lost" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420000F8" edc:access="---------------------------nnnnn" edc:cname="TXEFA" edc:impl="0x1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EFAI" edc:desc="Event FIFO Acknowledge Index" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420000FC" edc:offset="0x304"/>
      <edc:SFRDef edc:_addr="0x42000400" edc:access="rrrrrrrrrrrr--------------------" edc:cname="CREL" edc:impl="0xFFF00000" edc:mclr="00110010000100000000000000000000" edc:nzwidth="0x20" edc:por="00110010000100000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="SUBSTEP" edc:desc="Sub-step of Core Release" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="STEP" edc:desc="Step of Core Release" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REL" edc:desc="Core Release" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000404" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ENDN" edc:mclr="10000111011001010100001100100001" edc:nzwidth="0x20" edc:por="10000111011001010100001100100001" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="ETV" edc:desc="Endianness Test Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000408" edc:access="------------------------------nn" edc:cname="MRCFG" edc:impl="0x3" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="QOS" edc:desc="Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Background (no sensitive operation)" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Sensitive Bandwidth" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Sensitive Latency" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Critical Latency" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200040C" edc:access="--------n--nnnnn---nnnnnnnnnnnnn" edc:cname="DBTP" edc:impl="0x9F1FFF" edc:mclr="00000000000000000000101000110011" edc:nzwidth="0x20" edc:por="00000000000000000000101000110011" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="DSJW" edc:desc="Data (Re)Synchronization Jump Width" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DTSEG2" edc:desc="Data time segment after sample point" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DTSEG1" edc:desc="Data time segment before sample point" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DBRP" edc:desc="Data Baud Rate Prescaler" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TDC" edc:desc="Tranceiver Delay Compensation" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000410" edc:access="------------------------nnnn----" edc:cname="TEST" edc:impl="0xF0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LBCK" edc:desc="Loop Back Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TX" edc:desc="Control of Transmit Pin" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CORE" edc:desc="TX controlled by CAN core" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SAMPLE" edc:desc="TX monitoring sample point" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DOMINANT" edc:desc="Dominant (0) level at pin CAN_TX" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RECESSIVE" edc:desc="Recessive (1) level at pin CAN_TX" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RX" edc:desc="Receive Pin" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
