Duet3D/Duet3Expansion/src/atmel/SAME51_DFP/1.1.129/edc/ATSAME51J18A.PIC
      <edc:SFRDef edc:_addr="0xE000ED9C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RBAR" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="Region number" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:desc="Region number valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Region base address" edc:nzwidth="0x1B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDA0" edc:access="---n-nnn--nnnnnnnnnnnnnn------nn" edc:cname="RASR" edc:impl="0x173FFF03" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Region Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="Region Size" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SRD" edc:desc="Sub-region disable" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="B" edc:desc="Bufferable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C" edc:desc="Cacheable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="Shareable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEX" edc:desc="TEX bit" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AP" edc:desc="Access Permission" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XN" edc:desc="Execute Never Attribute" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDA4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RBAR_A1" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="Region number" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:desc="Region number valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Region base address" edc:nzwidth="0x1B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDA8" edc:access="---n-nnn--nnnnnnnnnnnnnn------nn" edc:cname="RASR_A1" edc:impl="0x173FFF03" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Region Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="Region Size" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SRD" edc:desc="Sub-region disable" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="B" edc:desc="Bufferable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C" edc:desc="Cacheable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="Shareable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEX" edc:desc="TEX bit" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AP" edc:desc="Access Permission" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XN" edc:desc="Execute Never Attribute" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDAC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RBAR_A2" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="Region number" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:desc="Region number valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Region base address" edc:nzwidth="0x1B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDB0" edc:access="---n-nnn--nnnnnnnnnnnnnn------nn" edc:cname="RASR_A2" edc:impl="0x173FFF03" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Region Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="Region Size" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SRD" edc:desc="Sub-region disable" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="B" edc:desc="Bufferable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C" edc:desc="Cacheable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="Shareable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEX" edc:desc="TEX bit" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AP" edc:desc="Access Permission" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XN" edc:desc="Execute Never Attribute" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDB4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RBAR_A3" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="Region number" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:desc="Region number valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Region base address" edc:nzwidth="0x1B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDB8" edc:access="---n-nnn--nnnnnnnnnnnnnn------nn" edc:cname="RASR_A3" edc:impl="0x173FFF03" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Region Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="Region Size" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SRD" edc:desc="Sub-region disable" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="B" edc:desc="Bufferable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C" edc:desc="Cacheable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="Shareable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEX" edc:desc="TEX bit" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AP" edc:desc="Access Permission" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XN" edc:desc="Execute Never Attribute" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EDBC" edc:offset="0x34"/>
      <edc:SFRDef edc:_addr="0xE000EDF0" edc:access="nnnnnnnnnnnnnnnn----------n-nnnn" edc:cname="DHCSR" edc:impl="0xFFFF002F" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="C_DEBUGEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_HALT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_STEP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_MASKINTS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C_SNAPSTALL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="DBGKEY" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="-15"/>
            <edc:SFRFieldDef edc:cname="S_HALT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SLEEP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_LOCKUP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="S_RETIRE_ST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_RESET_ST" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
